Reports/СправкаРасчетРаспределенияКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетРаспределенияКосвенныхРасходов</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОперации</Name>
					<Comment>1- общепроизводственные расходы, 2 - общехозяйственные расходы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РасчетРаспределенияКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РасчетРаспределенияКосвенныхРасходов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБазыНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетРаспределения</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппаРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасчетаКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийРасчетаКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасчетаКосвенныхРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределениеОбщепроизводственныхРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеОбщехозяйственныхРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиБезИспользованияПлановыхЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукцииИУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРаспределенияКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияКосвенныхРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъемВыпуска</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСебестоимость</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямыеЗатраты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельныеСтатьиПрямыхЗатрат</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаспределяется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаРасчетРаспределенияКосвенныхРасходов/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
	Перем НП Экспорт;
	
	Функция СформироватьТекстЗапроса()
		
		Текст	= "ВЫБРАТЬ
		|	РасчетРаспределенияКосвенныхРасходов.ПериодРасчета КАК Период,
		|	РасчетРаспределенияКосвенныхРасходов.БазаРаспределения КАК База,
		|	РасчетРаспределенияКосвенныхРасходов.Подразделение КАК ПодразделениеЗатрат,
		|	РасчетРаспределенияКосвенныхРасходов.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ПОДСТРОКА(РасчетРаспределенияКосвенныхРасходов.СчетРаспределения.Код, 1, 2) КАК СчетЗатрат,
		|	РасчетРаспределенияКосвенныхРасходов.ПодразделениеРаспределения КАК Подразделение,
		|	РасчетРаспределенияКосвенныхРасходов.НоменклатурнаяГруппаРаспределения КАК НоменклатурнаяГруппа,
		|	РасчетРаспределенияКосвенныхРасходов.СуммаБазы КАК СуммаБаза,
		|	РасчетРаспределенияКосвенныхРасходов.СуммаБазыНУ КАК СуммаБазаНУ,
		|	РасчетРаспределенияКосвенныхРасходов.Сумма КАК Сумма,
		|	РасчетРаспределенияКосвенныхРасходов.СуммаНУ КАК СуммаНУ
		|ИЗ
		|	РегистрСведений.РасчетРаспределенияКосвенныхРасходов КАК РасчетРаспределенияКосвенныхРасходов
		|ГДЕ
		|	РасчетРаспределенияКосвенныхРасходов.Активность
		|	И РасчетРаспределенияКосвенныхРасходов.Организация = &Организация
		|	И РасчетРаспределенияКосвенныхРасходов.ВидОперации = &ВидОперации
		|	И РасчетРаспределенияКосвенныхРасходов.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	База УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(СуммаБаза),
		|	МАКСИМУМ(СуммаБазаНУ),
		|	СУММА(Сумма),
		|	СУММА(СуммаНУ)
		|ПО
		|	Период";
		
		Возврат Текст;
		
	КонецФункции
	
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
	//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
	//
	Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
		
		НачалоПериода = НачалоДня(ДатаНач);
		КонецПериода  = КонецДня(ДатаКон);
		
		ДокументРезультат.Очистить();
		
		Макет      = ПолучитьМакет("ОбщепроизводственныеРасходы");
		// 37490 <<
		КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		// 37490 >>
		
		МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
		// 37490 <<
		МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
		// 37490 >>
		
		ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
		
		
		// Когда нужен только заголовок:
		Если ТолькоЗаголовок Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
			ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
		
		Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
			
			ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
			ОграниченияПоПостроителюОтчета = СтрЗаменить(ОграниченияПоПостроителюОтчета, "Субконто1", "Подразделение");
			
		КонецЕсли;
		
		Запрос.Текст = СформироватьТекстЗапроса();
		
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "Активность","Активность " + ОграниченияПоПостроителюОтчета);
		
		ТекстЗаголовка = НСтр("ru='общепроизводственных расходов';uk='загальновиробничих витрат'", КодЯзыкаПечать);
		Запрос.Текст = Запрос.Текст + ",База,ПодразделениеЗатрат,СтатьяЗатрат,СчетЗатрат,НоменклатурнаяГруппа";
		Запрос.УстановитьПараметр("ВидОперации",    Перечисления.ВидыОперацийРасчетаКосвенныхРасходов.РаспределениеОбщепроизводственныхРасходов);
		
		
		Результат = Запрос.Выполнить();
		
		СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
		СтрОтбор = СтрЗаменить(СтрОтбор, "Субконто1", "Подразделение");
		
		Если Не ПустаяСтрока(СтрОтбор) Тогда
			ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");
			ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + СтрОтбор;
			ДокументРезультат.Вывести(ОбластьОтбор);
		КонецЕсли;
		
		ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьПодСтрока        = Макет.ПолучитьОбласть("ПодСтрока");
		ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
		ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
		
		ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
		
		
		ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период");
		Всего = 0;
		ВсегоНУ = 0;
		
		Пока ВыборкаПериод.Следующий() Цикл
			
			ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериод.Период), КонецМесяца(ВыборкаПериод.Период), "ФП = Истина");
			ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
			ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ВыборкаПериод.Период);
			ЗаголовокОтчета.Параметры.НазваниеОтчета      = "Распределение " + ТекстЗаголовка + НСтр("ru=' на расходы производства (бухгалтерский учет)';uk=' на витрати виробництва (бухгалтерський облік)'", КодЯзыкаПечать);
			ДокументРезультат.Вывести(ЗаголовокОтчета);
			
			// Параметр для показа заголовка
			ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
			
			ВыборкаБаза = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаБаза.Следующий() Цикл
				
				
				ОбластьШапка.Параметры.База = НСтр("ru='Распределение пропорционально ';uk='Розподіл пропорційно '", КодЯзыкаПечать) + БазаПадеж(ВыборкаБаза.База, "Дательный", КодЯзыкаПечать);
				ОбластьШапка.Параметры.ТекстБазы = ВыборкаБаза.База;
				ДокументРезультат.Вывести(ОбластьШапка);
				
				ВыборкаПодразделение = ВыборкаБаза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПодразделение.Следующий() Цикл
						
					ВсегоБаза  = 0;
					ВсегоБазаНУ  = 0;
					ВсегоСумма = ВыборкаПодразделение.Сумма;
					ВсегоСуммаНУ = ВыборкаПодразделение.СуммаНУ;
						
					Выборка = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатурнаяГруппа");
					Пока Выборка.Следующий() Цикл
						ВсегоБаза = ВсегоБаза  + ?(Выборка.СуммаБаза = NULL, 0, Выборка.СуммаБаза);
						ВсегоБазаНУ = ВсегоБазаНУ  + ?(Выборка.СуммаБазаНУ = NULL, 0, Выборка.СуммаБазаНУ);
					КонецЦикла;
						
					ВыборкаСтатьяЗатрат = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
						ПерваяСтрокаСтатьиЗатрат = Истина;
							
						ВыборкаСчет = ВыборкаСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСчет.Следующий() Цикл
							ВыборкаНомГруппа = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаНомГруппа.Следующий() Цикл
								Выборка = ВыборкаНомГруппа;
									
								Если ПерваяСтрокаСтатьиЗатрат Тогда
									Область = ОбластьСтрока;
									Область.Параметры.Подразделение    = ВыборкаПодразделение.ПодразделениеЗатрат;
									Область.Параметры.СтатьяЗатрат     = Выборка.СтатьяЗатрат;
									Область.Параметры.СуммаЗатрат      = ВыборкаСтатьяЗатрат.Сумма;
									Область.Параметры.СуммаЗатратНУ      = ВыборкаСтатьяЗатрат.СуммаНУ;
								Иначе
									Область = ОбластьПодСтрока;
								КонецЕсли;
								Область.Параметры.СчетЗатрат       = Выборка.СчетЗатрат;
								Область.Параметры.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
								Область.Параметры.СуммаБазы            = Выборка.СуммаБаза;
								Область.Параметры.СуммаБазыНУ          = Выборка.СуммаБазаНУ;
								Область.Параметры.Коэффициент          = ?(ВсегоБаза = 0, 0, Выборка.СуммаБаза / ВсегоБаза);
								Область.Параметры.КоэффициентНУ        = ?(ВсегоБазаНУ = 0, 0, Выборка.СуммаБазаНУ / ВсегоБазаНУ);
								Область.Параметры.Сумма                = Выборка.Сумма;
								Область.Параметры.СуммаНУ              = Выборка.СуммаНУ;
								ДокументРезультат.Вывести(Область);
									
								ПерваяСтрокаСтатьиЗатрат = Ложь;
									
							КонецЦикла;  // НомГруппа
						КонецЦикла;  // СчетУчета
					КонецЦикла;  // СтатьяЗатрат
						
						
					ОбластьИтого.Параметры.СуммаБазы   = ВсегоБаза;
					ОбластьИтого.Параметры.Сумма       = ВсегоСумма;
					ОбластьИтого.Параметры.СуммаБазыНУ = ВсегоБазаНУ;
					ОбластьИтого.Параметры.СуммаНУ       = ВсегоСуммаНУ;
					ДокументРезультат.Вывести(ОбластьИтого);
						
				КонецЦикла;  // Подразделение
					
				ОбластьВсего.Параметры.Сумма       = ВыборкаБаза.Сумма;
				ОбластьВсего.Параметры.СуммаНУ       = ВыборкаБаза.СуммаНУ;
				ДокументРезультат.Вывести(ОбластьВсего);
				
				
				ДокументРезультат.Вывести(ОбластьОкончаниеТаблицы);
			КонецЦикла;  // База
			
			ОбластьПодвал.Параметры.ТекстПримечания = "";
			ДокументРезультат.Вывести(ОбластьПодвал);
			
			ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
			
			ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
			
		КонецЦикла;    // Период	
		
		// Зафиксируем заголовок отчета
		ДокументРезультат.ФиксацияСверху = 8;
		
		// Первую колонку не печатаем
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Распределение косвенных расходов';uk='Розподіл непрямих витрат'", КодЯзыкаПечать);
		
		УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
		
	КонецПроцедуры // СформироватьОтчет
	
	
	Функция БазаПадеж(База, Падеж, КодЯзыкаПечать)
		
		Если База = Перечисления.СпособыРаспределенияКосвенныхРасходов.МатериальныеЗатраты Тогда
			Возврат ?(Падеж = "Родительный", НСтр("ru=' материальных расходов';uk=' матеріальних витрат'", КодЯзыкаПечать), НСтр("ru=' материальным расходам';uk=' матеріальним витратам'", КодЯзыкаПечать));
		ИначеЕсли База = Перечисления.СпособыРаспределенияКосвенныхРасходов.ОплатаТруда Тогда
			Возврат ?(Падеж = "Родительный", НСтр("ru=' расходов по оплате труда';uk=' витрат з оплати праці'", КодЯзыкаПечать), НСтр("ru=' расходам по оплате труда';uk=' витратам з оплати праці'", КодЯзыкаПечать));
		ИначеЕсли База = Перечисления.СпособыРаспределенияКосвенныхРасходов.ПлановаяСебестоимость Тогда
			Возврат НСтр("ru=' плановой себестоимости';uk=' планової собівартості'", КодЯзыкаПечать);
		ИначеЕсли База = Перечисления.СпособыРаспределенияКосвенныхРасходов.ОбъемВыпуска Тогда
			Возврат ?(Падеж = "Родительный", НСтр("ru=' выпуска';uk=' випуску'", КодЯзыкаПечать), НСтр("ru=' выпуску';uk=' випуску'", КодЯзыкаПечать));
		ИначеЕсли База = Перечисления.СпособыРаспределенияКосвенныхРасходов.НеРаспределяется Тогда	
			Возврат ?(Падеж = "Родительный", НСтр("ru=' расходов, не распределяемых автоматически';uk=' витратам, що не розподіляються автоматично'"), НСтр("ru=' расходам, не распределяемым автоматически';uk=' витратам, що не розподіляються автоматично'", КодЯзыкаПечать));
		КонецЕсли;	 
		
	КонецФункции
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	// 
	
	НП = Новый НастройкаПериода;
	
#КонецЕсли
